** Test
#+begin_src scheme :results output
  (load "5.19.register-machine.scm")
  (define (mach-fact-run n)
    (let ((mach-fact
           (make-machine
            (list (list '* *)
                  (list '- -)
                  (list '= =))
            '((assign continue (label fact-done))       ; set up final return address
              fact-loop
                (test (op =) (reg n) (const 1))
                (branch (label base-case))
                ;; Set up for the recursive call by saving n and continue.
                ;; Set up continue so that the computation will continue
                ;; at after-fact when the subroutine returns.
                (save continue)
                (save n)
                (assign n (op -) (reg n) (const 1))
                (assign continue (label after-fact))
                (goto (label fact-loop))
              after-fact
                (restore n)
                (restore continue)
                (assign val (op *) (reg n) (reg val))   ; val now contains n(n - 1)!
                (goto (reg continue))                   ; return to caller
              base-case
                (assign val (const 1))                  ; base case: 1! = 1
                (goto (reg continue))                   ; return to caller
              fact-done))))
      (set-register-contents! mach-fact 'n n)
      (mach-fact 'trace-on)
      ((mach-fact 'register-trace-on) 'val)
      (set-breakpoint mach-fact 'fact-loop 3)
      (start mach-fact)
      (set-breakpoint mach-fact 'after-fact 2)
      (proceed-machine mach-fact)
      (print (mach-fact 'breakpoints))
      (cancel-breakpoint mach-fact 'fact-loop 3)
      (proceed-machine mach-fact)
      (cancel-all-breakpoints mach-fact)
      (proceed-machine mach-fact)))
  (mach-fact-run 10)
#+end_src

#+RESULTS:
#+begin_example

#f (assign continue (label fact-done))
fact-loop (test (op =) (reg n) (const 1))
fact-loop (branch (label base-case))
fact-loop (save continue)
fact-loop (save n)
breakpoint (fact-loop 3)
fact-loop (assign n (op -) (reg n) (const 1))
fact-loop (assign continue (label after-fact))
fact-loop (goto (label fact-loop))
fact-loop (test (op =) (reg n) (const 1))
fact-loop (branch (label base-case))
fact-loop (save continue)
fact-loop (save n)
breakpoint (fact-loop 3)
((after-fact 2) (fact-loop 3))
fact-loop (assign n (op -) (reg n) (const 1))
fact-loop (assign continue (label after-fact))
fact-loop (goto (label fact-loop))
fact-loop (test (op =) (reg n) (const 1))
fact-loop (branch (label base-case))
fact-loop (save continue)
fact-loop (save n)
fact-loop (assign n (op -) (reg n) (const 1))
fact-loop (assign continue (label after-fact))
fact-loop (goto (label fact-loop))
fact-loop (test (op =) (reg n) (const 1))
fact-loop (branch (label base-case))
fact-loop (save continue)
fact-loop (save n)
fact-loop (assign n (op -) (reg n) (const 1))
fact-loop (assign continue (label after-fact))
fact-loop (goto (label fact-loop))
fact-loop (test (op =) (reg n) (const 1))
fact-loop (branch (label base-case))
fact-loop (save continue)
fact-loop (save n)
fact-loop (assign n (op -) (reg n) (const 1))
fact-loop (assign continue (label after-fact))
fact-loop (goto (label fact-loop))
fact-loop (test (op =) (reg n) (const 1))
fact-loop (branch (label base-case))
fact-loop (save continue)
fact-loop (save n)
fact-loop (assign n (op -) (reg n) (const 1))
fact-loop (assign continue (label after-fact))
fact-loop (goto (label fact-loop))
fact-loop (test (op =) (reg n) (const 1))
fact-loop (branch (label base-case))
fact-loop (save continue)
fact-loop (save n)
fact-loop (assign n (op -) (reg n) (const 1))
fact-loop (assign continue (label after-fact))
fact-loop (goto (label fact-loop))
fact-loop (test (op =) (reg n) (const 1))
fact-loop (branch (label base-case))
fact-loop (save continue)
fact-loop (save n)
fact-loop (assign n (op -) (reg n) (const 1))
fact-loop (assign continue (label after-fact))
fact-loop (goto (label fact-loop))
fact-loop (test (op =) (reg n) (const 1))
fact-loop (branch (label base-case))
fact-loop (save continue)
fact-loop (save n)
fact-loop (assign n (op -) (reg n) (const 1))
fact-loop (assign continue (label after-fact))
fact-loop (goto (label fact-loop))
fact-loop (test (op =) (reg n) (const 1))
fact-loop (branch (label base-case))
base-case (assign val (const 1))
reg val *unassigned* to 1
base-case (goto (reg continue))
after-fact (restore n)
after-fact (restore continue)
after-fact (assign val (op *) (reg n) (reg val))
reg val 1 to 2
after-fact (goto (reg continue))
after-fact (restore n)
breakpoint (after-fact 2)
after-fact (restore continue)
after-fact (assign val (op *) (reg n) (reg val))
reg val 2 to 6
after-fact (goto (reg continue))
after-fact (restore n)
after-fact (restore continue)
after-fact (assign val (op *) (reg n) (reg val))
reg val 6 to 24
after-fact (goto (reg continue))
after-fact (restore n)
after-fact (restore continue)
after-fact (assign val (op *) (reg n) (reg val))
reg val 24 to 120
after-fact (goto (reg continue))
after-fact (restore n)
after-fact (restore continue)
after-fact (assign val (op *) (reg n) (reg val))
reg val 120 to 720
after-fact (goto (reg continue))
after-fact (restore n)
after-fact (restore continue)
after-fact (assign val (op *) (reg n) (reg val))
reg val 720 to 5040
after-fact (goto (reg continue))
after-fact (restore n)
after-fact (restore continue)
after-fact (assign val (op *) (reg n) (reg val))
reg val 5040 to 40320
after-fact (goto (reg continue))
after-fact (restore n)
after-fact (restore continue)
after-fact (assign val (op *) (reg n) (reg val))
reg val 40320 to 362880
after-fact (goto (reg continue))
after-fact (restore n)
after-fact (restore continue)
after-fact (assign val (op *) (reg n) (reg val))
reg val 362880 to 3628800
after-fact (goto (reg continue))
#+end_example
